orgs/2014-10-7-jQuery-and-fonts-library-cdn-server.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS: toc:nil
#+BEGIN_HTML
---
excerpt: Describe the principles in detail. And how to blog with emacs jekyll and github page.
layout: post
category : html5
tags : [jquery, cdn]
---
#+END_HTML
 * Problem
 I found the ajax.googleapis.com and fonts.googleapis.com are blocked by GFW in china. The pages containing those resources fail to be loaded here.
 * Solution
 I changed it to a chinese local miror server provided by 360. I replace all the googleapis with useso.
 #+BEGIN_SRC bash
  ajax.googleapis.com   > ajax.useso.com
  fonts.googleapis.com  > fonts.useso.com
 #+END_SRC
   Although it will slow the loading speed outside China. It works at least. And in our great local network inside the GFW, it works super fast.