_posts/2014-10-7-jQuery-and-fonts-library-cdn-server.html
---
excerpt: Describe the principles in detail. And how to blog with emacs jekyll and github page.
layout: post
category : html5
tags : [jquery, cdn]
---
<ul class="org-ul">
<li>Problem
</li>
</ul>
<p>
I found the ajax.googleapis.com and fonts.googleapis.com are blocked by GFW in china. The pages containing those resources fail to be loaded here.
</p>
<ul class="org-ul">
<li>Solution
</li>
</ul>
<p>
I changed it to a Chinese local mirror server provided by 360. I replace all the googleapis with useso.
</p>
<div class="org-src-container">

<pre class="src src-bash">ajax.googleapis.com   &gt; ajax.useso.com
fonts.googleapis.com  &gt; fonts.useso.com
</pre>
</div>
<p>
Although it will slow the loading speed outside China. It works at least. And in our great local network inside the GFW, it works super fast.</p>
